# -*- coding:utf-8 -*-

from pprint import pprint


rember_list = ["wowerwefhb",
               {'非托管:renda：APP_首页>模块位置：navigation>title：善源甄选>错误提示：': {'淳化县': {'淳化县商品': {'米面杂粮': {'酒水茶饮': '酒水茶饮内容为空'}, '生鲜蔬果': '生鲜蔬果内容为空'}}, '旬邑县': {'旬邑县商品': {'熟食': '熟食内容为空'}}, '长武县': {'长武县商品': {'生鲜水果 \u3000': '生鲜水果 \u3000内容为空'}}, '永寿县': {'永寿县商品': {'米面粮油 \u3000': '米面粮油 \u3000内容为空', '南北干货  \u3000': '南北干货  \u3000内容为空', '熟食\u3000': '熟食\u3000内容为空', '方便速食 \u3000\u3000': '方便速食 \u3000\u3000内容为空', '生鲜蔬果 \u3000\u3000': '生鲜蔬果 \u3000\u3000内容为空'}}, '善源有品': {'商品列表': {'生鲜水果\u3000': '生鲜水果\u3000内容为空'}}, '央企': {'公益中国煤科': {'武乡县': '武乡县内容为空'}, '公益中国兵器': {'红河县': '红河县内容为空'}, '公益保利': {'鲁甸县': {'五台县': '五台县内容为空'}}, '公益航天科技': {'太白县': '太白县内容为空'}}, '国家机关': {'公益文旅': {'静乐县': {'娄烦 县': '娄烦 县内容为空'}}, '公益工信': {'中阳县': '中阳县内容为空'}, '公益工委': {'平山县': '平山县内容为空'}}, '其它联盟': {'公益扶贫基金会': {'隰县': '隰县内容为空'}}}},
               {'非托管:renda：APP_首页>模块位置：recommendGoods>错误提示：': {'淳化县': {'淳化县商品': {'米面杂粮': {'酒水茶饮': '酒水茶饮内容为空'}, '生鲜蔬果': '生鲜蔬果内容为空'}}, '旬邑县': {'旬邑县商品': {'熟食': '熟食内容为空'}}, '长武县': {'长武县商品': {'生鲜水果 \u3000': '生鲜水果 \u3000内容为空'}}, '永寿县': {'永寿县商品': {'米面粮油 \u3000': '米面粮油 \u3000内容为空', '南北干货  \u3000': '南北干货  \u3000内容为空', '熟食\u3000': '熟食\u3000内容为空', '方便速食 \u3000\u3000': '方便速食 \u3000\u3000内容为空', '生鲜蔬果 \u3000\u3000': '生鲜蔬果 \u3000\u3000内容为空'}}, '善源有品': {'商品列表': {'生鲜水果\u3000': '生鲜水果\u3000内容为空'}}, '央企': {'公益中国煤科': {'武乡县': '武乡县内容为空'}, '公益中国兵器': {'红河县': '红河县内容为空'}, '公益保利': {'鲁甸县': {'五台县': '五台县内容为空'}}, '公益航天科技': {'太白县': '太白县内容为空'}}, '国家机关': {'公益文旅': {'静乐县': {'娄烦 县': '娄烦 县内容为空'}}, '公益工信': {'中阳县': '中阳县内容为空'}, '公益工委': {'平山县': '平山县内容为空'}}, '其它联盟': {'公益扶贫基金会': {'隰县': '隰县内容为空'}}}},
               {'非托管:renda：APP_首页>模块位置：qualityGoods>错误提示：': {'淳化县': {'淳化县商品': {'米面杂粮': {'酒水茶饮': '酒水茶饮内容为空'}, '生鲜蔬果': '生鲜蔬果内容为空'}}, '旬邑县': {'旬邑县商品': {'熟食': '熟食内容为空'}}, '长武县': {'长武县商品': {'生鲜水果 \u3000': '生鲜水果 \u3000内容为空'}}, '永寿县': {'永寿县商品': {'米面粮油 \u3000': '米面粮油 \u3000内容为空', '南北干货  \u3000': '南北干货  \u3000内容为空', '熟食\u3000': '熟食\u3000内容为空', '方便速食 \u3000\u3000': '方便速食 \u3000\u3000内容为空', '生鲜蔬果 \u3000\u3000': '生鲜蔬果 \u3000\u3000内容为空'}}, '善源有品': {'商品列表': {'生鲜水果\u3000': '生鲜水果\u3000内容为空'}}, '央企': {'公益中国煤科': {'武乡县': '武乡县内容为空'}, '公益中国兵器': {'红河县': '红河县内容为空'}, '公益保利': {'鲁甸县': {'五台县': '五台县内容为空'}}, '公益航天科技': {'太白县': '太白县内容为空'}}, '国家机关': {'公益文旅': {'静乐县': {'娄烦 县': '娄烦 县内容为空'}}, '公益工信': {'中阳县': '中阳县内容为空'}, '公益工委': {'平山县': '平山县内容为空'}}, '其它联盟': {'公益扶贫基金会': {'隰县': '隰县内容为空'}}}},
               {'非托管:renda：APP_首页>模块位置：supremeGoods>错误提示：': {'淳化县': {'淳化县商品': {'米面杂粮': {'酒水茶饮': '酒水茶饮内容为空'}, '生鲜蔬果': '生鲜蔬果内容为空'}}, '旬邑县': {'旬邑县商品': {'熟食': '熟食内容为空'}}, '长武县': {'长武县商品': {'生鲜水果 \u3000': '生鲜水果 \u3000内容为空'}}, '永寿县': {'永寿县商品': {'米面粮油 \u3000': '米面粮油 \u3000内容为空', '南北干货  \u3000': '南北干货  \u3000内容为空', '熟食\u3000': '熟食\u3000内容为空', '方便速食 \u3000\u3000': '方便速食 \u3000\u3000内容为空', '生鲜蔬果 \u3000\u3000': '生鲜蔬果 \u3000\u3000内容为空'}}, '善源有品': {'商品列表': {'生鲜水果\u3000': '生鲜水果\u3000内容为空'}}, '央企': {'公益中国煤科': {'武乡县': '武乡县内容为空'}, '公益中国兵器': {'红河县': '红河县内容为空'}, '公益保利': {'鲁甸县': {'五台县': '五台县内容为空'}}, '公益航天科技': {'太白县': '太白县内容为空'}}, '国家机关': {'公益文旅': {'静乐县': {'娄烦 县': '娄烦 县内容为空'}}, '公益工信': {'中阳县': '中阳县内容为空'}, '公益工委': {'平山县': '平山县内容为空'}}, '其它联盟': {'公益扶贫基金会': {'隰县': '隰县内容为空'}}}},
               "非托管:boc：APP_首页>模块位置：focus>错误提示：商品无效",
               ]

def outside(d):
    def _inner(src, dst, pattern=""):
        for k, v in src.items():
            key = "{}{}".format(k,"空白商品目录") if pattern == "" else "{}->{}".format(pattern, k)
            if isinstance(v, dict):
                _inner(v, dst, key)
            else:
                dst[key] = v
    result = {}
    _inner(d, result)
    return result

for list_item in rember_list:
    if isinstance(list_item, str):
        print(list_item)
    else:
        for k, v in outside(list_item).items():
            print(k, v)





